benchmarks/definitive_results/advisor/output_length/_390/opt-2.7b/_512__2000/log_15930253.out
WARNING 02-21 19:09:36 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=22801, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_mean.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-2.7b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=2000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='online_results/output_length/_390/opt-2.7b/_512__2000', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=22801 --enable-chunked-prefill --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-2.7b --max-num-seqs=512', launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=390, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     2000      
Benchmark duration (s):                  138.46    
Total input tokens:                      484000    
Total generated tokens:                  780000    
Request throughput (req/s):              14.45     
Output token throughput (tok/s):         5633.56   
Total Token throughput (tok/s):          9129.26   
---------------Time to First Token----------------
Mean TTFT (ms):                          58984.82  
Median TTFT (ms):                        57771.84  
P99 TTFT (ms):                           125113.86 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          52.42     
Median TPOT (ms):                        54.57     
P99 TPOT (ms):                           65.09     
---------------Inter-token Latency----------------
Mean ITL (ms):                           52.42     
Median ITL (ms):                         52.06     
P99 ITL (ms):                            273.03    
==================================================
Concurrent checker terminated
Server terminated